app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'studentuser1@gmail.com'
 LIMIT 1
---
    public function login()
    {
        helper(['form']);
        $data = [];

        if ($this->request->getMethod(true) === 'POST') {
            $rules = [
                'email' => 'required|valid_email',
                'password' => 'required|min_length[6]|max_length[255]',
            ];

            if ($this->validate($rules)) {
                $userModel = new UserModel();
                $user = $userModel->where('email', $this->request->getVar('email'))->first();

SELECT *
FROM `courses`
SELECT *
FROM `users`
WHERE `role` = 'student'
---

        if ($role === 'admin') {
            //Get all courses
            $allCourses = $courseModel->findAll();
            //Get all students
            $allStudents = $userModel->where('role', 'student')->findAll();

SELECT *
FROM `courses`
---
            // Get courses the user is already enrolled in
            $enrolledCourses = $enrollmentModel->getUserEnrollments($user_id);
            // Get all courses
            $allCourses = $courseModel->findAll();