app/Models/EnrollmentModel.php

    public function getUserEnrollments($user_id)
    {
        return $this->select('enrollments.*, courses.title AS course_name, enrollments.enrollment_date AS enrollment_date')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->where('enrollments.user_id', $user_id)
            ->orderBy('enrollments.enrollment_date', 'DESC')
            ->findAll();
---
SELECT `enrollments`.*, `courses`.`title` AS `course_name`, `enrollments`.`enrollment_date` AS `enrollment_date`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '1'
ORDER BY `enrollments`.`enrollment_date` DESC